In [1]:
pip install kagglehub

Requirement already satisfied: kagglehub in /opt/anaconda3/lib/python3.13/site-packages (0.3.13)
Requirement already satisfied: packaging in /opt/anaconda3/lib/python3.13/site-packages (from kagglehub) (24.2)
Requirement already satisfied: pyyaml in /opt/anaconda3/lib/python3.13/site-packages (from kagglehub) (6.0.2)
Requirement already satisfied: requests in /opt/anaconda3/lib/python3.13/site-packages (from kagglehub) (2.32.3)
Requirement already satisfied: tqdm in /opt/anaconda3/lib/python3.13/site-packages (from kagglehub) (4.67.1)
Requirement already satisfied: charset-normalizer<4,>=2 in /opt/anaconda3/lib/python3.13/site-packages (from requests->kagglehub) (3.3.2)
Requirement already satisfied: idna<4,>=2.5 in /opt/anaconda3/lib/python3.13/site-packages (from requests->kagglehub) (3.7)
Requirement already satisfied: urllib3<3,>=1.21.1 in /opt/anaconda3/lib/python3.13/site-packages (from requests->kagglehub) (2.3.0)
Requirement already satisfied: certifi>=2017.4.17 in /opt/anaconda3/lib/python3.13/site-packages (from requests->kagglehub) (2025.7.14)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import kagglehub

# Download latest version
path = kagglehub.dataset_download("jahias/microsoft-adventure-works-cycles-customer-data")

print("Path to dataset files:", path)

Path to dataset files: /Users/manyasharma/.cache/kagglehub/datasets/jahias/microsoft-adventure-works-cycles-customer-data/versions/1

In [5]:
import os
import pandas as pd

# Path to the dataset folder downloaded via kagglehub
path_customers = "/Users/manyasharma/.cache/kagglehub/datasets/jahias/microsoft-adventure-works-cycles-customer-data/versions/1"

# Load the main customer data CSV file
df1 = pd.read_csv(os.path.join(path_customers, "AWCustomers.csv"))

# Display the first 7 rows
df1.head(7)

,CustomerID,Title,FirstName,MiddleName,LastName,Suffix,AddressLine1,AddressLine2,City,StateProvinceName,...,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,LastUpdated
0,21173,NaN,Chad,C,Yuan,NaN,7090 C. Mount Hood,NaN,Wollongong,New South Wales,...,Bachelors,Clerical,M,M,1,3,0,1,81916,2017-03-06
1,13249,NaN,Ryan,NaN,Perry,NaN,3651 Willow Lake Rd,NaN,Shawnee,British Columbia,...,Partial College,Clerical,M,M,1,2,1,2,81076,2017-03-06
2,29350,NaN,Julia,NaN,Thompson,NaN,1774 Tice Valley Blvd.,NaN,West Covina,California,...,Bachelors,Clerical,F,S,0,3,0,0,86387,2017-03-06
3,13503,NaN,Theodore,NaN,Gomez,NaN,2103 Baldwin Dr,NaN,Liverpool,England,...,Partial College,Skilled Manual,M,M,1,2,1,2,61481,2017-03-06
4,22803,NaN,Marshall,J,Shan,NaN,Am Gallberg 234,NaN,Werne,Nordrhein-Westfalen,...,Partial College,Skilled Manual,M,S,1,1,0,0,51804,2017-03-06
5,22092,NaN,Andrea,NaN,Young,NaN,9384 Ashmount Way,NaN,Tacoma,Washington,...,High School,Skilled Manual,F,M,1,2,2,2,61944,2017-03-06
6,11229,NaN,Adrian,C,Stewart,NaN,6898 Shaw Rd.,NaN,Redwood City,California,...,Partial College,Manual,M,S,1,1,0,0,34919,2017-03-06

In [6]:
path_sales=r"/Users/manyasharma/.cache/kagglehub/datasets/jahias/microsoft-adventure-works-cycles-customer-data/versions/1/AWSales.csv"
df2=pd.read_csv(path_sales)
df2.head(9)

   CustomerID  BikeBuyer  AvgMonthSpend
0       21173          1          50.97
1       13249          1          53.11
2       29350          1          54.08
3       13503          1          56.93
4       22803          1          55.41
5       22092          1          49.31
6       11229          0          56.01
7       24179          1          49.29
8       12127          1          50.05

In [10]:
import os
import pandas as pd


path_test_class = "/Users/manyasharma/.cache/kagglehub/datasets/jahias/microsoft-adventure-works-cycles-customer-data/versions/1"


print("Files in dataset folder:", os.listdir(path_test_class))


df3 = pd.read_csv(os.path.join(path_test_class, "AWCustomers.csv"))

# Display first few rows
df3.head()

Files in dataset folder: ['AWSales.csv', 'AWTest-Classification.csv', 'AWCustomers.csv', 'AWTest-Regression.csv']

,CustomerID,Title,FirstName,MiddleName,LastName,Suffix,AddressLine1,AddressLine2,City,StateProvinceName,...,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,LastUpdated
0,21173,NaN,Chad,C,Yuan,NaN,7090 C. Mount Hood,NaN,Wollongong,New South Wales,...,Bachelors,Clerical,M,M,1,3,0,1,81916,2017-03-06
1,13249,NaN,Ryan,NaN,Perry,NaN,3651 Willow Lake Rd,NaN,Shawnee,British Columbia,...,Partial College,Clerical,M,M,1,2,1,2,81076,2017-03-06
2,29350,NaN,Julia,NaN,Thompson,NaN,1774 Tice Valley Blvd.,NaN,West Covina,California,...,Bachelors,Clerical,F,S,0,3,0,0,86387,2017-03-06
3,13503,NaN,Theodore,NaN,Gomez,NaN,2103 Baldwin Dr,NaN,Liverpool,England,...,Partial College,Skilled Manual,M,M,1,2,1,2,61481,2017-03-06
4,22803,NaN,Marshall,J,Shan,NaN,Am Gallberg 234,NaN,Werne,Nordrhein-Westfalen,...,Partial College,Skilled Manual,M,S,1,1,0,0,51804,2017-03-06

In [15]:
import os
import pandas as pd

path_test_regression = "/Users/manyasharma/.cache/kagglehub/datasets/jahias/microsoft-adventure-works-cycles-customer-data/versions/1"

print("Files in dataset folder:", os.listdir(path_test_regression))

df4 = pd.read_csv(os.path.join(path_test_regression, "AWTest-Regression.csv"))


df4.head()

Files in dataset folder: ['AWSales.csv', 'AWTest-Classification.csv', 'AWCustomers.csv', 'AWTest-Regression.csv']

,CustomerID,Title,FirstName,MiddleName,LastName,Suffix,AddressLine1,AddressLine2,City,StateProvinceName,...,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,LastUpdated
0,11908,NaN,Rafael,A,Tang,NaN,8839 Leonard Dr,NaN,South Melbourne,Victoria,...,Graduate Degree,Professional,M,S,1,2,0,0,135915,2017-03-06
1,12286,NaN,Nathan,M,Jenkins,NaN,3093 Roland Drive,NaN,Peterborough,England,...,Graduate Degree,Professional,M,S,1,2,0,0,137732,2017-03-06
2,12892,NaN,Brian,NaN,Peterson,NaN,1284 Poppy Pl.,NaN,Royal Oak,British Columbia,...,Graduate Degree,Professional,M,M,1,2,0,0,135404,2017-03-06
3,14698,NaN,Diane,NaN,Navarro,NaN,Potsdamer Straße 92324,NaN,Frankfurt am Main,Saarland,...,Bachelors,Management,F,M,1,3,0,0,104040,2017-03-06
4,15085,NaN,Kristin,H,Jai,NaN,"88, impasse Notre-Dame",NaN,Morangis,Essonne,...,Graduate Degree,Professional,F,S,1,0,0,0,129319,2017-03-06

In [16]:
print(df1.columns.tolist())

['CustomerID', 'Title', 'FirstName', 'MiddleName', 'LastName', 'Suffix', 'AddressLine1', 'AddressLine2', 'City', 'StateProvinceName', 'CountryRegionName', 'PostalCode', 'PhoneNumber', 'BirthDate', 'Education', 'Occupation', 'Gender', 'MaritalStatus', 'HomeOwnerFlag', 'NumberCarsOwned', 'NumberChildrenAtHome', 'TotalChildren', 'YearlyIncome', 'LastUpdated']

In [17]:
print(df4.columns.tolist())

['CustomerID', 'Title', 'FirstName', 'MiddleName', 'LastName', 'Suffix', 'AddressLine1', 'AddressLine2', 'City', 'StateProvinceName', 'CountryRegionName', 'PostalCode', 'PhoneNumber', 'BirthDate', 'Education', 'Occupation', 'Gender', 'MaritalStatus', 'HomeOwnerFlag', 'NumberCarsOwned', 'NumberChildrenAtHome', 'TotalChildren', 'YearlyIncome', 'LastUpdated']

In [ ]:
selected_features = [
   'FirstName', 'LastName', 'AddressLine1', 'City', 'StateProvinceName', 'CountryRegionName', 'PostalCode', 'BirthDate', 'Education', 'Occupation', 'Gender', 'MaritalStatus', 'HomeOwnerFlag', 'NumberCarsOwned', 'NumberChildrenAtHome', 'TotalChildren', 'YearlyIncome', 'LastUpdated'
]
df1=df1[selected_features]

In [18]:
df1.head()

,CustomerID,Title,FirstName,MiddleName,LastName,Suffix,AddressLine1,AddressLine2,City,StateProvinceName,...,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,LastUpdated
0,21173,NaN,Chad,C,Yuan,NaN,7090 C. Mount Hood,NaN,Wollongong,New South Wales,...,Bachelors,Clerical,M,M,1,3,0,1,81916,2017-03-06
1,13249,NaN,Ryan,NaN,Perry,NaN,3651 Willow Lake Rd,NaN,Shawnee,British Columbia,...,Partial College,Clerical,M,M,1,2,1,2,81076,2017-03-06
2,29350,NaN,Julia,NaN,Thompson,NaN,1774 Tice Valley Blvd.,NaN,West Covina,California,...,Bachelors,Clerical,F,S,0,3,0,0,86387,2017-03-06
3,13503,NaN,Theodore,NaN,Gomez,NaN,2103 Baldwin Dr,NaN,Liverpool,England,...,Partial College,Skilled Manual,M,M,1,2,1,2,61481,2017-03-06
4,22803,NaN,Marshall,J,Shan,NaN,Am Gallberg 234,NaN,Werne,Nordrhein-Westfalen,...,Partial College,Skilled Manual,M,S,1,1,0,0,51804,2017-03-06

In [19]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18361 entries, 0 to 18360
Data columns (total 24 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerID            18361 non-null  int64
 1   Title                 101 non-null    object
 2   FirstName             18361 non-null  object
 3   MiddleName            10572 non-null  object
 4   LastName              18361 non-null  object
 5   Suffix                3 non-null      object
 6   AddressLine1          18361 non-null  object
 7   AddressLine2          311 non-null    object
 8   City                  18361 non-null  object
 9   StateProvinceName     18361 non-null  object
 10  CountryRegionName     18361 non-null  object
 11  PostalCode            18361 non-null  object
 12  PhoneNumber           18361 non-null  object
 13  BirthDate             18361 non-null  object
 14  Education             18361 non-null  object
 15  Occupation            18361 non-null  object
 16  Gender                18361 non-null  object
 17  MaritalStatus         18361 non-null  object
 18  HomeOwnerFlag         18361 non-null  int64
 19  NumberCarsOwned       18361 non-null  int64
 20  NumberChildrenAtHome  18361 non-null  int64
 21  TotalChildren         18361 non-null  int64
 22  YearlyIncome          18361 non-null  int64
 23  LastUpdated           18361 non-null  object
dtypes: int64(6), object(18)
memory usage: 3.4+ MB

In [ ]:
df1.loc[:,'YearlyIncome'] = df1['YearlyIncome']/df1['YearlyIncome'].max()

In [20]:
df1['YearlyIncome'].head(10)

0    81916
1    81076
2    86387
3    61481
4    51804
5    61944
6    34919
7    61832
8    83834
9    26880
Name: YearlyIncome, dtype: int64

In [21]:
df1.loc[:,'NumberCarsOwned'] = df1['NumberCarsOwned']/df1['NumberCarsOwned'].max()
df1['NumberCarsOwned'].head(10)

/var/folders/f9/rfgwzncn6k168mh2bb9tby4h0000gn/T/ipykernel_3537/560241045.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '[0.6 0.4 0.6 ... 0.4 0.  0.4]' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df1.loc[:,'NumberCarsOwned'] = df1['NumberCarsOwned']/df1['NumberCarsOwned'].max()

0    0.6
1    0.4
2    0.6
3    0.4
4    0.2
5    0.4
6    0.2
7    0.2
8    0.0
9    0.2
Name: NumberCarsOwned, dtype: float64

In [22]:
df1.loc[:,'TotalChildren'] = df1['TotalChildren']/df1['TotalChildren'].max()
df1['TotalChildren'].head(10)

/var/folders/f9/rfgwzncn6k168mh2bb9tby4h0000gn/T/ipykernel_3537/3444078298.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '[0.33333333 0.66666667 0.         ... 0.         0.         0.        ]' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df1.loc[:,'TotalChildren'] = df1['TotalChildren']/df1['TotalChildren'].max()

0    0.333333
1    0.666667
2    0.000000
3    0.666667
4    0.000000
5    0.666667
6    0.000000
7    0.000000
8    0.666667
9    0.000000
Name: TotalChildren, dtype: float64

In [23]:
pip install datetime

Collecting datetime
  Downloading DateTime-5.5-py3-none-any.whl.metadata (33 kB)
Requirement already satisfied: zope.interface in /opt/anaconda3/lib/python3.13/site-packages (from datetime) (7.1.1)
Requirement already satisfied: pytz in /opt/anaconda3/lib/python3.13/site-packages (from datetime) (2024.1)
Requirement already satisfied: setuptools in /opt/anaconda3/lib/python3.13/site-packages (from zope.interface->datetime) (72.1.0)
Downloading DateTime-5.5-py3-none-any.whl (52 kB)
Installing collected packages: datetime
Successfully installed datetime-5.5
Note: you may need to restart the kernel to use updated packages.

In [24]:
import pandas as pd
from datetime import datetime

# Ensure BirthDate is converted properly
df1['BirthDate'] = pd.to_datetime(df1['BirthDate'], errors='coerce')

# Check if conversion worked
print(df1['BirthDate'].head())

# Drop rows where conversion failed (optional)
df1 = df1.dropna(subset=['BirthDate'])

# Calculate age
today = pd.Timestamp.today()
df1['Age'] = (today - df1['BirthDate']).dt.days // 365

print(df1[['BirthDate', 'Age']].head())

0   1987-11-13
1   1972-07-21
2   1985-11-09
3   1977-10-18
4   1975-02-05
Name: BirthDate, dtype: datetime64[ns]
   BirthDate  Age
0 1987-11-13   38
1 1972-07-21   53
2 1985-11-09   40
3 1977-10-18   48
4 1975-02-05   50

In [25]:
bins = [0, 18, 50, df1['Age'].max() ]
GroupNames = ['Young', 'Adult', 'Senior']
df1['AgeBins'] =pd.cut(df1['Age'], bins, labels=GroupNames, include_lowest=True)
df1[['Age', 'AgeBins']].head()

   Age AgeBins
0   38   Adult
1   53  Senior
2   40   Adult
3   48   Adult
4   50   Adult

In [26]:
df1['YearlyIncome'].max

<bound method Series.max of 0         81916
1         81076
2         86387
3         61481
4         51804
          ...
18356     52953
18357     60992
18358     51859
18359     87177
18360    136856
Name: YearlyIncome, Length: 18361, dtype: int64>

In [28]:
import numpy as np

arr = np.linspace(0, 1, 4)
print(arr)

[0.         0.33333333 0.66666667 1.        ]

In [29]:
bins = arr
GroupNames = ['High Income', 'Medium Income', 'Low Income']
df1['IncomeCat'] =pd.cut(df1['YearlyIncome'], bins, labels=GroupNames, include_lowest=True)
df1[['YearlyIncome', 'IncomeCat']].head(10)

   YearlyIncome IncomeCat
0         81916       NaN
1         81076       NaN
2         86387       NaN
3         61481       NaN
4         51804       NaN
5         61944       NaN
6         34919       NaN
7         61832       NaN
8         83834       NaN
9         26880       NaN

In [ ]:
df1[['YearlyIncome','Age']]=df1[['YearlyIncome', 'Age']].astype(float)

In [31]:
from sklearn.preprocessing import StandardScaler
scaler=StandardScaler()
df=df1.loc[:,['Age','YearlyIncome']]
df.loc[:,['Age','YearlyIncome']]=scaler.fit_transform(df1[['Age','YearlyIncome']])
df.head()

/var/folders/f9/rfgwzncn6k168mh2bb9tby4h0000gn/T/ipykernel_3537/3176681661.py:4: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '[-0.47493944  0.85692883 -0.29735701 ... -0.20856579 -1.18526918
 -0.38614822]' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df.loc[:,['Age','YearlyIncome']]=scaler.fit_transform(df1[['Age','YearlyIncome']])
/var/folders/f9/rfgwzncn6k168mh2bb9tby4h0000gn/T/ipykernel_3537/3176681661.py:4: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '[ 0.29855522  0.27118044  0.44426075 ... -0.68097305  0.47000607
  2.08899616]' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df.loc[:,['Age','YearlyIncome']]=scaler.fit_transform(df1[['Age','YearlyIncome']])

        Age  YearlyIncome
0 -0.474939      0.298555
1  0.856929      0.271180
2 -0.297357      0.444261
3  0.412973     -0.367401
4  0.590555     -0.682765

In [33]:
import pandas as pd
import numpy as np


df_encoded = pd.DataFrame({
    'feature1': [0, 1, 0, 1],
    'feature2': [1, 1, 0, 0],
    'feature3': [1, 0, 1, 0]
})


obj1 = df_encoded.iloc[0].values
obj2 = df_encoded.iloc[1].values

# --- Simple Matching Coefficient (SMC) ---
matches = np.sum(obj1 == obj2)
smc = matches / len(obj1)
print(smc)

0.3333333333333333

In [34]:
intersection = np.sum((obj1 == 1) & (obj2 == 1))
union = np.sum((obj1 == 1) | (obj2 == 1))
jaccard = intersection / union if union != 0 else 0
print(jaccard)

0.3333333333333333

In [37]:
import pandas as pd
from sklearn.preprocessing import OneHotEncoder

# Check which columns actually exist in the DataFrame before dropping
# Uncomment the line below to see all available columns
# print(df_encoded.columns.tolist())

# 1. Drop only columns that exist in the DataFrame
# Modify this list to include only columns that actually exist in df_encoded
columns_to_drop = []  # Replace with columns that actually exist
df_clean = df_encoded.copy()  # Make a copy instead of dropping non-existent columns

# Alternative approach: if you want to keep only specific columns instead of dropping
# df_clean = df_encoded[columns_to_keep]

# 2. Separate categorical and numeric
categorical_cols = ['Education', 'Occupation', 'AgeBins', 'IncomeCat']
numeric_cols = ['HomeOwnerFlag', 'NumberCarsOwned', 'NumberChildrenAtHome', 
                'TotalChildren', 'YearlyIncome', 'Age']

# Check if these columns exist in the DataFrame
# Filter to include only columns that exist
categorical_cols = [col for col in categorical_cols if col in df_clean.columns]
numeric_cols = [col for col in numeric_cols if col in df_clean.columns]

# 3. One-Hot Encode categorical columns
if categorical_cols:  # Only proceed if there are categorical columns
    encoder = OneHotEncoder(drop='first', sparse_output=False)
    encoded = encoder.fit_transform(df_clean[categorical_cols])
    encoded_df = pd.DataFrame(encoded, columns=encoder.get_feature_names_out(categorical_cols))
    
    # 4. Merge back with numeric features
    if numeric_cols:  # Only include numeric columns if they exist
        df_ready = pd.concat([df_clean[numeric_cols].reset_index(drop=True), encoded_df], axis=1)
    else:
        df_ready = encoded_df
else:
    # If no categorical columns exist, just use numeric columns
    if numeric_cols:
        df_ready = df_clean[numeric_cols].reset_index(drop=True)
    else:
        df_ready = df_clean.copy()  # If neither exist, just use the original DataFrame